# Unit 2 Project - Data Cleaning

## Part 1: Prepare Environment and Jupyter Notebook

### Step 1: Create Virtual Environment

This step should have been completed prior to opening the Jupyter Notebook. Refer to project instructions.

### Step 2: Open Jupyter Notebook File

Congratulations! If you're here it means you have completed Step 2.

### Step 3: Load .csv Files into DataFrames

In [2]:
####### TO DO ########

# load house_data.csv into a dataframe using pd.read_csv()

# load house_sales.csv into a dataframe using pd.read_csv()

######################
import pandas as pd
raw_house_df = pd.read_csv('house_data.csv')
raw_sales_df = pd.read_csv('house_sales.csv')

In [3]:
###### TO DO ######

# use .head() on your new dataframe to show the dataframe was loaded succussfully
raw_house_df.head

<bound method NDFrame.head of        Unnamed: 0          ID  Bedrooms  Bathrooms  SQFT living  SQFT lot  \
0               0  7129300520         3       1.00         1180    5650.0
1               1  6414100192         3       2.25         2570    7242.0
2               2  5631500400         2       1.00          770   10000.0
3               3  2487200875         4       3.00         1960    5000.0
4               4  1954400510         3       2.00         1680    8080.0
...           ...         ...       ...        ...          ...       ...
21608       21608   263000018         3       2.50         1530    1131.0
21609       21609  6600060120         4       2.50         2310    5813.0
21610       21610  1523300141         2       0.75         1020    1350.0
21611       21611   291310100         3       2.50         1600    2388.0
21612       21612  1523300157         2       0.75         1020    1076.0

       Floors Waterfront?       View  House Condition  Grade  SQFT above  \
0         1.0          No  Very Poor     OK Condition    7.0      1180.0
1         2.0          No  Very Poor     OK Condition    7.0      2170.0
2         1.0          No  Very Poor     OK Condition    6.0       770.0
3         1.0          No  Very Poor  Great Condition    7.0      1050.0
4         1.0          No  Very Poor     OK Condition    8.0      1680.0
...       ...         ...        ...              ...    ...         ...
21608     3.0          No  Very Poor     OK Condition    8.0      1530.0
21609     2.0          No  Very Poor     OK Condition    8.0      2310.0
21610     2.0          No  Very Poor     OK Condition    7.0      1020.0
21611     2.0          No  Very Poor     OK Condition    8.0      1600.0
21612     2.0          No  Very Poor              NaN    7.0      1020.0

       SQFT basement  Year Built  Year Renovated  Zipcode      Lat     Long  \
0                  0      1955.0             NaN  98178.0  47.5112 -122.257
1                400      1951.0          1991.0  98125.0  47.7210 -122.319
2                  0      1933.0             NaN  98028.0  47.7379 -122.233
3                910      1965.0             NaN  98136.0  47.5208 -122.393
4                  0      1987.0             NaN  98074.0  47.6168 -122.045
...              ...         ...             ...      ...      ...      ...
21608              0      2009.0             0.0  98103.0  47.6993 -122.346
21609              0      2014.0             0.0  98146.0  47.5107 -122.362
21610              0         NaN             0.0  98144.0  47.5944 -122.299
21611              0      2004.0             0.0  98027.0  47.5345 -122.069
21612              0      2008.0             0.0  98144.0  47.5941 -122.299

       SQFT living 15  SQFT lot 15
0                1340         5650
1                1690         7639
2                2720         8062
3                1360         5000
4                1800         7503
...               ...          ...
21608            1530         1509
21609            1830         7200
21610            1020         2007
21611            1410         1287
21612            1020         1357

[21613 rows x 20 columns]>

In [4]:
###### TO DO ######

# use .head() on your second new dataframe to show the dataframe was loaded succussfully
raw_sales_df.head(10)

   Unnamed: 0          Id             DATE          Price
0           0  7129300520  20141013T000000    $221,900.00
1           1  6414100192  20141209T000000    $538,000.00
2           2  5631500400  20150225T000000    $180,000.00
3           3  2487200875  20141209T000000    $604,000.00
4           4  1954400510  20150218T000000    $510,000.00
5           5  7237550310  20140512T000000  $1,225,000.00
6           6  1321400060  20140627T000000    $257,500.00
7           7  2008000270  20150115T000000    $291,850.00
8           8  2414600126  20150415T000000    $229,500.00
9           9  3793500160  20150312T000000    $323,000.00

### Step 4: Create Data Dictionaries for Each Dataset

In [14]:
####### TO DO ###########

# Work in the cells below to fill in missing information in the data dictionary.

#### Data Dictionary - House Data

**id**:
> Description: id number of house
>
> Data type: int

**bedrooms**:
> Description: number of bedrooms
>
> Data type: int

**bathrooms**:
> Description: number of bathrooms
>
> Data type: int

**sqft_living**:
> Description: square feet of inside living space
>
> Data type: square feet

**sqft_lot**:
> Description: square feet of total property
>
> Data type: square feet

**floors**:
> Description: number of floors
>
> Data type: int

**waterfront**:
> Description: if property borders water
>
> Data type: yes/no (boolean?)

**view**:
> Description: outdoor view of house
>
> Data type: very poor - very good

**condition**:
> Description: physical condition of house
>
> Data type: very poor - very good

**grade**:
> Description: overall grade
>
> Data type: float

**sqft_above**:
> Description: square feet of airspace above house
>
> Data type: square feet 

**sqft_basement**:
> Description: square feet of basement
>
> Data type: square feet

**yr_built**:
> Description: year the house was built
>
> Data type: int

**yr_renovated**:
> Description: year the house was renovated
>
> Data type: int

**zipcode**:
> Description: zipcode of address
>
> Data type: int

**lat**:
> Description: GPS latitude
>
> Data type: float

**long**:
> Description: GPS longitude
>
> Data type: float

**sqft_living15**:
> Description: average square feet of living space of nearest 15 neighbors
>
> Data type: int

**sqft_lot15**:
> Description: average square feet of total property space of nearest 15 neighbors
>
> Data type: int

#### Data Dictionary - House Sales Data

**id**:
> Description: identification number of sale
>
> Data type: int

**date**:
> Description: date of sale
>
> Data type: varchar

**price**:
> Description: price of house
>
> Data type: int

### Step 5: Create Copies of DataFrames to Start Cleaning Process

In [4]:
###### TO DO ######

# create a copy of house_data

# create a copy of sales_data

house_df = raw_house_df.copy()
sales_df = raw_sales_df.copy()

In [9]:
###### TO DO ######

# use .head() on your new dataframe to show the dataframe was copied succussfully
house_df.head()

,Unnamed: 0,ID,Bedrooms,Bathrooms,SQFT living,SQFT lot,Floors,Waterfront?,View,House Condition,Grade,SQFT above,SQFT basement,Year Built,Year Renovated,Zipcode,Lat,Long,SQFT living 15,SQFT lot 15
0,0,7129300520,3,1.00,1180,5650.0,1.0,No,Very Poor,OK Condition,7.0,1180.0,0,1955.0,NaN,98178.0,47.5112,-122.257,1340,5650
1,1,6414100192,3,2.25,2570,7242.0,2.0,No,Very Poor,OK Condition,7.0,2170.0,400,1951.0,1991.0,98125.0,47.7210,-122.319,1690,7639
2,2,5631500400,2,1.00,770,10000.0,1.0,No,Very Poor,OK Condition,6.0,770.0,0,1933.0,NaN,98028.0,47.7379,-122.233,2720,8062
3,3,2487200875,4,3.00,1960,5000.0,1.0,No,Very Poor,Great Condition,7.0,1050.0,910,1965.0,NaN,98136.0,47.5208,-122.393,1360,5000
4,4,1954400510,3,2.00,1680,8080.0,1.0,No,Very Poor,OK Condition,8.0,1680.0,0,1987.0,NaN,98074.0,47.6168,-122.045,1800,7503

In [6]:
###### TO DO ######

# use .head() on your second new dataframe to show the dataframe was copied succussfully
sales_df.head()

   Unnamed: 0          Id             DATE        Price
0           0  7129300520  20141013T000000  $221,900.00
1           1  6414100192  20141209T000000  $538,000.00
2           2  5631500400  20150225T000000  $180,000.00
3           3  2487200875  20141209T000000  $604,000.00
4           4  1954400510  20150218T000000  $510,000.00

## Part 2: Assess Data and Create Data Cleaning Plan

### Step 1: Check Column Names, Casing, Spelling, Etc.

In [8]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

house_df.info()
house_df.head()
sales_df.info()
sales_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       21613 non-null  int64
 1   ID               21613 non-null  int64
 2   Bedrooms         21613 non-null  int64
 3   Bathrooms        21611 non-null  float64
 4   SQFT living      21613 non-null  int64
 5   SQFT lot         21611 non-null  float64
 6   Floors           21613 non-null  float64
 7   Waterfront?      21605 non-null  object
 8   View             21611 non-null  object
 9   House Condition  21607 non-null  object
 10  Grade            21611 non-null  float64
 11  SQFT above       21612 non-null  float64
 12  SQFT basement    21613 non-null  int64
 13  Year Built       21612 non-null  float64
 14  Year Renovated   21276 non-null  float64
 15  Zipcode          21610 non-null  float64
 16  Lat              21612 non-null  float64
 17  Long             21612 non-null  float64
 18  SQFT living 15   21613 non-null  int64
 19  SQFT lot 15      21613 non-null  int64
dtypes: float64(10), int64(7), object(3)
memory usage: 3.3+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  21613 non-null  int64
 1   Id          21613 non-null  int64
 2   DATE        21613 non-null  object
 3   Price       21609 non-null  object
dtypes: int64(2), object(2)
memory usage: 675.5+ KB

   Unnamed: 0          Id             DATE        Price
0           0  7129300520  20141013T000000  $221,900.00
1           1  6414100192  20141209T000000  $538,000.00
2           2  5631500400  20150225T000000  $180,000.00
3           3  2487200875  20141209T000000  $604,000.00
4           4  1954400510  20150218T000000  $510,000.00

### Step 2: Validate Data Types

In [19]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

Q: Do any of the data types in the dataframe need to be changed? probably

remove question mark from waterfront
all column titles lowercase
remove all spaces from column titles, replace with _
i suppose you can have a floor and a half, so floors can be a float
delete unnamed column
zipcode string
change waterfront to boolean or i suppose you can keep it as object yes/no
remove $ from price and change to float so you can calculate

In [17]:
print(sales_df)

       Unnamed: 0          Id             DATE        Price
0               0  7129300520  20141013T000000  $221,900.00
1               1  6414100192  20141209T000000  $538,000.00
2               2  5631500400  20150225T000000  $180,000.00
3               3  2487200875  20141209T000000  $604,000.00
4               4  1954400510  20150218T000000  $510,000.00
...           ...         ...              ...          ...
21608       21608   263000018  20140521T000000  $360,000.00
21609       21609  6600060120  20150223T000000  $400,000.00
21610       21610  1523300141  20140623T000000  $402,101.00
21611       21611   291310100  20150116T000000  $400,000.00
21612       21612  1523300157  20141015T000000  $325,000.00

[21613 rows x 4 columns]

### Step 3: Detect Missing Values

In [15]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ########

sales_df.isnull()

       Unnamed: 0     Id   DATE  Price
0           False  False  False  False
1           False  False  False  False
2           False  False  False  False
3           False  False  False  False
4           False  False  False  False
...           ...    ...    ...    ...
21608       False  False  False  False
21609       False  False  False  False
21610       False  False  False  False
21611       False  False  False  False
21612       False  False  False  False

[21613 rows x 4 columns]


Q: Which variables/columns have missing values? i think i need to change some column titles before i can use value_counts() since some of the titles have spaces in them :(

In [18]:
house_df.value_counts()

Unnamed: 0  ID          Bedrooms  Bathrooms  SQFT living  SQFT lot  Floors  Waterfront?  View       House Condition  Grade  SQFT above  SQFT basement  Year Built  Year Renovated  Zipcode  Lat      Long      SQFT living 15  SQFT lot 15
1           6414100192  3         2.25       2570         7242.0    2.0     No           Very Poor  OK Condition     7.0    2170.0      400            1951.0      1991.0          98125.0  47.7210  -122.319  1690            7639           1
14490       7831800411  4         1.75       1510         5500.0    1.5     No           Very Poor  OK Condition     7.0    1510.0      0              1920.0      0.0             98106.0  47.5350  -122.359  1320            6431           1
14488       5631500905  2         1.00       1280         5728.0    1.5     No           Very Poor  Great Condition  6.0    1280.0      0              1941.0      0.0             98028.0  47.7477  -122.232  2480            9775           1
14487       8899210610  3         2.50       2330         8627.0    1.0     No           Very Poor  Good Condition   7.0    1480.0      850            1980.0      0.0             98055.0  47.4543  -122.210  1940            9607           1
14486       4302200790  2         1.00       720          5160.0    1.0     No           Very Poor  OK Condition     6.0    720.0       0              1949.0      0.0             98106.0  47.5274  -122.357  990             5160           1
                                                                                                                                                                                                                                             ..
7397        2464400500  4         1.75       1980         2700.0    1.5     No           Very Poor  OK Condition     8.0    1210.0      770            1931.0      0.0             98115.0  47.6865  -122.320  1720            2910           1
7396        1328330430  2         1.75       1270         7800.0    1.0     No           Very Poor  Good Condition   7.0    890.0       380            1981.0      0.0             98058.0  47.4438  -122.134  2020            8025           1
7395        3343901188  3         1.00       1320         7200.0    1.0     No           Very Poor  Good Condition   7.0    1320.0      0              1959.0      0.0             98056.0  47.5048  -122.190  1720            7249           1
7394        3625700080  4         2.25       3270         15760.0   1.0     No           Very Poor  Good Condition   10.0   2000.0      1270           1974.0      0.0             98040.0  47.5295  -122.229  4100            15760          1
21611       291310100   3         2.50       1600         2388.0    2.0     No           Very Poor  OK Condition     8.0    1600.0      0              2004.0      0.0             98027.0  47.5345  -122.069  1410            1287           1
Length: 21252, dtype: int64

A: ##### TO DO #####

house_df - year renovated, house condition

### Step 4: Detect Outliers

In [21]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

Q: Which variables/columns have outliers?

A: ##### TO DO #####

### Step 5: Write Data Cleaning Plan

In [22]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

#### Data Cleaning Plan:

####### TO DO #######

## Part 3: Execute Data Cleaning Plan Using DEFINE / CLEAN / TEST Approach

### Step 1: Understand DEFINE / CLEAN / TEST Approach

Refer to project instructions for an explanation of this step. You can copy and past the template in the cell below to use in each step of Part 3 as you are treating the issues you found in the data.

In [23]:
### DEFINE ###


### CLEAN ### 


### TEST ###

### Step 2: Treat Names / Casing / Spelling Issues

In [24]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

In [25]:
### DEFINE ###


### CLEAN ### 


### TEST ###

### Step 3: Treat Missing Values

In [26]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

In [27]:
### DEFINE ###


### CLEAN ### 


### TEST ###

### Step 4: Treat Outliers

In [28]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

In [29]:
### DEFINE ###


### CLEAN ### 


### TEST ###

### Step 5: Summarize Actions Taken & Justify Approach

In [30]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

####### TO DO ###### - Edit this cell to add your summary and justification per project instructions.

## Part 4: Re-Express Categorical Variables

### Step 1: Determine Which Variables Need to Be Re-Expressed

In [31]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

List categorical variables which need to be re-expressed here:

- ########## TO DO ###########
- ########## TO DO ###########
- ########## TO DO ###########
- ########## TO DO ########### ........

### Step 2: Choose Method to Re-Express Variables

In [32]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

Edit this cell to explain which method you are choosing to re-express each variable and why.

### Step 3: Perform Transformation

In [33]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

### Step 4: Summarize Actions Taken & Justify Approach

In [34]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

Edit this cell to add your summary and justification per project instructions.

## Part 5: Combine Datasets into Master DataFrame

### Step 1: Choose Method to Merge DataFrames into New Master DataFrame

In [35]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

Edit this cell to explain which method you are choosing to merge the data and why.

### Step 2: Merge DataFrames

In [36]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

In [37]:
# Use .head() method to print first few rows of new master dataframe

### Step 3: Save Master DataFrame to New .CSV

In [38]:
######################### TO DO ###################################

####### FOLLOW PROJECT DIRECTIONS TO COMPLETE THIS STEP ###########

### Step 4: Push to GitHub / Share Link with Tech Lead & SME

##### This step will be completed outside of Jupyter Notebook. See "Submitting Project" Video Walkthrough from Unit 1 if you have any questions.

### Step 5: Record Brief Code Walkthrough / Share Link with Tech Lead & SME

##### This step will be completed outside of Jupyter Notebook. See "Submitting Project" Video Walkthrough from Unit 1 if you have any questions.